Assignment 03/app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars" WHERE (make like '%d%' or model like '%d%' or vin like '%d%')
---
  def search
    @cars = Car.where("model like :search OR vin like :search", search:"%#{params[:query]}%")

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @cars = Car.find(params[:id]) #show car

SELECT "parts".* FROM "parts" WHERE 1=0
---
  def new
    @car = Car.new
    @parts = Part.all

SELECT "parts".* FROM "parts" WHERE 1=0
---
  def edit
    @parts = Part.all

SELECT "parts".* FROM "parts" WHERE 1=0
INSERT INTO "cars" ("model", "vin", "make_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["model", "DeLorean"], ["vin", "10003"], ["make_id", 1], ["created_at", "2019-10-05 21:33:42.487668"], ["updated_at", "2019-10-05 21:33:42.487668"]]
---
  def create
    @car = Car.new(car_params)
    @parts = Part.all # added to prevent create from breaking when no values entered

    respond_to do |format|
      if @car.save

UPDATE "cars" SET "vin" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["vin", "10002"], ["updated_at", "2019-09-22 00:36:35.723509"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @car.update(car_params)