Assignment 03/app/controllers/makes_controller.rb

  def search
    @makes = Make.where("name like ?", "%#{params[:query]}%")
---
SELECT "makes".* FROM "makes" WHERE (name like '%d%')

  def index
    @makes = Make.all
---
SELECT "makes".* FROM "makes"

  def show
    @makes = Make.find(params[:id]) #show make
---
SELECT  "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @make = Make.new(make_params)

    respond_to do |format|
      if @make.save
---
INSERT INTO "makes" ("name", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Porsche"], ["country", "Germany"], ["created_at", "2019-10-05 21:34:57.838279"], ["updated_at", "2019-10-05 21:34:57.838279"]]

  def destroy
    @make.destroy
---
DELETE FROM "makes" WHERE "makes"."id" = ?  [["id", 4]]

    def set_make
      @make = Make.find(params[:id])
---
SELECT  "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]