Assignment 03/app/controllers/parts_controller.rb

SELECT "parts".* FROM "parts" WHERE (name like '%en%')
---
  def search
    @parts = Part.where("name like ?", "%#{params[:query]}%")

SELECT  "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @parts = Part.find(params[:id]) #show part

INSERT INTO "parts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Mr. Fusion"], ["created_at", "2019-10-05 21:35:28.520138"], ["updated_at", "2019-10-05 21:35:28.520138"]]
---
  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save

SELECT  "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_part
      @part = Part.find(params[:id])